analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/spixfm_regs.h
#define MXC_F_SPIXFM_CTRL_LOCLK_POS                    8 /**< CTRL_LOCLK Position */
#define MXC_F_SPIXFM_CTRL_LOCLK                        ((uint32_t)(0xFUL << MXC_F_SPIXFM_CTRL_LOCLK_POS)) /**< CTRL_LOCLK Mask */

#define MXC_F_SPIXFM_CTRL_HICLK_POS                    12 /**< CTRL_HICLK Position */
#define MXC_F_SPIXFM_CTRL_HICLK                        ((uint32_t)(0xFUL << MXC_F_SPIXFM_CTRL_HICLK_POS)) /**< CTRL_HICLK Mask */

#define MXC_F_SPIXFM_CTRL_SSACT_POS                    16 /**< CTRL_SSACT Position */
#define MXC_F_SPIXFM_CTRL_SSACT                        ((uint32_t)(0x3UL << MXC_F_SPIXFM_CTRL_SSACT_POS)) /**< CTRL_SSACT Mask */
#define MXC_V_SPIXFM_CTRL_SSACT_OFF                    ((uint32_t)0x0UL) /**< CTRL_SSACT_OFF Value */
#define MXC_S_SPIXFM_CTRL_SSACT_OFF                    (MXC_V_SPIXFM_CTRL_SSACT_OFF << MXC_F_SPIXFM_CTRL_SSACT_POS) /**< CTRL_SSACT_OFF Setting */
#define MXC_V_SPIXFM_CTRL_SSACT_FOR_2_MOD_CLK          ((uint32_t)0x1UL) /**< CTRL_SSACT_FOR_2_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSACT_FOR_2_MOD_CLK          (MXC_V_SPIXFM_CTRL_SSACT_FOR_2_MOD_CLK << MXC_F_SPIXFM_CTRL_SSACT_POS) /**< CTRL_SSACT_FOR_2_MOD_CLK Setting */
#define MXC_V_SPIXFM_CTRL_SSACT_FOR_4_MOD_CLK          ((uint32_t)0x2UL) /**< CTRL_SSACT_FOR_4_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSACT_FOR_4_MOD_CLK          (MXC_V_SPIXFM_CTRL_SSACT_FOR_4_MOD_CLK << MXC_F_SPIXFM_CTRL_SSACT_POS) /**< CTRL_SSACT_FOR_4_MOD_CLK Setting */
#define MXC_V_SPIXFM_CTRL_SSACT_FOR_8_MOD_CLK          ((uint32_t)0x3UL) /**< CTRL_SSACT_FOR_8_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSACT_FOR_8_MOD_CLK          (MXC_V_SPIXFM_CTRL_SSACT_FOR_8_MOD_CLK << MXC_F_SPIXFM_CTRL_SSACT_POS) /**< CTRL_SSACT_FOR_8_MOD_CLK Setting */

#define MXC_F_SPIXFM_CTRL_SSINACT_POS                  18 /**< CTRL_SSINACT Position */
#define MXC_F_SPIXFM_CTRL_SSINACT                      ((uint32_t)(0x3UL << MXC_F_SPIXFM_CTRL_SSINACT_POS)) /**< CTRL_SSINACT Mask */
#define MXC_V_SPIXFM_CTRL_SSINACT_FOR_1_MOD_CLK        ((uint32_t)0x0UL) /**< CTRL_SSINACT_FOR_1_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSINACT_FOR_1_MOD_CLK        (MXC_V_SPIXFM_CTRL_SSINACT_FOR_1_MOD_CLK << MXC_F_SPIXFM_CTRL_SSINACT_POS) /**< CTRL_SSINACT_FOR_1_MOD_CLK Setting */
#define MXC_V_SPIXFM_CTRL_SSINACT_FOR_3_MOD_CLK        ((uint32_t)0x1UL) /**< CTRL_SSINACT_FOR_3_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSINACT_FOR_3_MOD_CLK        (MXC_V_SPIXFM_CTRL_SSINACT_FOR_3_MOD_CLK << MXC_F_SPIXFM_CTRL_SSINACT_POS) /**< CTRL_SSINACT_FOR_3_MOD_CLK Setting */
#define MXC_V_SPIXFM_CTRL_SSINACT_FOR_5_MOD_CLK        ((uint32_t)0x2UL) /**< CTRL_SSINACT_FOR_5_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSINACT_FOR_5_MOD_CLK        (MXC_V_SPIXFM_CTRL_SSINACT_FOR_5_MOD_CLK << MXC_F_SPIXFM_CTRL_SSINACT_POS) /**< CTRL_SSINACT_FOR_5_MOD_CLK Setting */
#define MXC_V_SPIXFM_CTRL_SSINACT_FOR_9_MOD_CLK        ((uint32_t)0x3UL) /**< CTRL_SSINACT_FOR_9_MOD_CLK Value */
#define MXC_S_SPIXFM_CTRL_SSINACT_FOR_9_MOD_CLK        (MXC_V_SPIXFM_CTRL_SSINACT_FOR_9_MOD_CLK << MXC_F_SPIXFM_CTRL_SSINACT_POS) /**< CTRL_SSINACT_FOR_9_MOD_CLK Setting */

/**@} end of group SPIXFM_CTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_FETCHCTRL SPIXFM_FETCHCTRL
 * @brief    SPIX Fetch Control Register.
 * @{
 */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_VAL_POS             0 /**< FETCHCTRL_CMD_VAL Position */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_VAL                 ((uint32_t)(0xFFUL << MXC_F_SPIXFM_FETCHCTRL_CMD_VAL_POS)) /**< FETCHCTRL_CMD_VAL Mask */

#define MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS            8 /**< FETCHCTRL_CMD_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH                ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS)) /**< FETCHCTRL_CMD_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE         ((uint32_t)0x0UL) /**< FETCHCTRL_CMD_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE         (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO        ((uint32_t)0x1UL) /**< FETCHCTRL_CMD_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO        ((uint32_t)0x2UL) /**< FETCHCTRL_CMD_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID        ((uint32_t)0x3UL) /**< FETCHCTRL_CMD_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID        (MXC_V_SPIXFM_FETCHCTRL_CMD_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_CMD_WDTH_POS) /**< FETCHCTRL_CMD_WDTH_INVALID Setting */

#define MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS           10 /**< FETCHCTRL_ADDR_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH               ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS)) /**< FETCHCTRL_ADDR_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE        ((uint32_t)0x0UL) /**< FETCHCTRL_ADDR_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE        (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO       ((uint32_t)0x1UL) /**< FETCHCTRL_ADDR_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO       ((uint32_t)0x2UL) /**< FETCHCTRL_ADDR_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID       ((uint32_t)0x3UL) /**< FETCHCTRL_ADDR_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID       (MXC_V_SPIXFM_FETCHCTRL_ADDR_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_ADDR_WDTH_POS) /**< FETCHCTRL_ADDR_WDTH_INVALID Setting */

#define MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS           12 /**< FETCHCTRL_DATA_WDTH Position */
#define MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH               ((uint32_t)(0x3UL << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS)) /**< FETCHCTRL_DATA_WDTH Mask */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE        ((uint32_t)0x0UL) /**< FETCHCTRL_DATA_WDTH_SINGLE Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE        (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_SINGLE << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_SINGLE Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO       ((uint32_t)0x1UL) /**< FETCHCTRL_DATA_WDTH_DUAL_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_DUAL_IO << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_DUAL_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO       ((uint32_t)0x2UL) /**< FETCHCTRL_DATA_WDTH_QUAD_IO Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_QUAD_IO << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_QUAD_IO Setting */
#define MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID       ((uint32_t)0x3UL) /**< FETCHCTRL_DATA_WDTH_INVALID Value */
#define MXC_S_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID       (MXC_V_SPIXFM_FETCHCTRL_DATA_WDTH_INVALID << MXC_F_SPIXFM_FETCHCTRL_DATA_WDTH_POS) /**< FETCHCTRL_DATA_WDTH_INVALID Setting */

