analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/spixfm_regs.h
#define MXC_F_SPIXFM_FETCHCTRL_4BADDR_POS              16 /**< FETCHCTRL_4BADDR Position */
#define MXC_F_SPIXFM_FETCHCTRL_4BADDR                  ((uint32_t)(0x1UL << MXC_F_SPIXFM_FETCHCTRL_4BADDR_POS)) /**< FETCHCTRL_4BADDR Mask */

/**@} end of group SPIXFM_FETCHCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_MODECTRL SPIXFM_MODECTRL
 * @brief    SPIX Mode Control Register.
 * @{
 */
#define MXC_F_SPIXFM_MODECTRL_MDCLK_POS                0 /**< MODECTRL_MDCLK Position */
#define MXC_F_SPIXFM_MODECTRL_MDCLK                    ((uint32_t)(0xFUL << MXC_F_SPIXFM_MODECTRL_MDCLK_POS)) /**< MODECTRL_MDCLK Mask */

#define MXC_F_SPIXFM_MODECTRL_NOCMD_POS                8 /**< MODECTRL_NOCMD Position */
#define MXC_F_SPIXFM_MODECTRL_NOCMD                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_MODECTRL_NOCMD_POS)) /**< MODECTRL_NOCMD Mask */

#define MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD_POS           9 /**< MODECTRL_EXIT_NOCMD Position */
#define MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD               ((uint32_t)(0x1UL << MXC_F_SPIXFM_MODECTRL_EXIT_NOCMD_POS)) /**< MODECTRL_EXIT_NOCMD Mask */

/**@} end of group SPIXFM_MODECTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_MODEDATA SPIXFM_MODEDATA
 * @brief    SPIX Mode Data Register.
 * @{
 */
#define MXC_F_SPIXFM_MODEDATA_DATA_POS                 0 /**< MODEDATA_DATA Position */
#define MXC_F_SPIXFM_MODEDATA_DATA                     ((uint32_t)(0xFFFFUL << MXC_F_SPIXFM_MODEDATA_DATA_POS)) /**< MODEDATA_DATA Mask */

#define MXC_F_SPIXFM_MODEDATA_OUT_EN_POS               16 /**< MODEDATA_OUT_EN Position */
#define MXC_F_SPIXFM_MODEDATA_OUT_EN                   ((uint32_t)(0xFFFFUL << MXC_F_SPIXFM_MODEDATA_OUT_EN_POS)) /**< MODEDATA_OUT_EN Mask */

/**@} end of group SPIXFM_MODEDATA_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_FBCTRL SPIXFM_FBCTRL
 * @brief    SPIX Feedback Control Register.
 * @{
 */
#define MXC_F_SPIXFM_FBCTRL_EN_POS                     0 /**< FBCTRL_EN Position */
#define MXC_F_SPIXFM_FBCTRL_EN                         ((uint32_t)(0x1UL << MXC_F_SPIXFM_FBCTRL_EN_POS)) /**< FBCTRL_EN Mask */

#define MXC_F_SPIXFM_FBCTRL_INVERT_POS                 1 /**< FBCTRL_INVERT Position */
#define MXC_F_SPIXFM_FBCTRL_INVERT                     ((uint32_t)(0x1UL << MXC_F_SPIXFM_FBCTRL_INVERT_POS)) /**< FBCTRL_INVERT Mask */

/**@} end of group SPIXFM_FBCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_IOCTRL SPIXFM_IOCTRL
 * @brief    SPIX IO Control Register.
 * @{
 */
#define MXC_F_SPIXFM_IOCTRL_SCLK_DS_POS                0 /**< IOCTRL_SCLK_DS Position */
#define MXC_F_SPIXFM_IOCTRL_SCLK_DS                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_IOCTRL_SCLK_DS_POS)) /**< IOCTRL_SCLK_DS Mask */

#define MXC_F_SPIXFM_IOCTRL_SS_DS_POS                  1 /**< IOCTRL_SS_DS Position */
#define MXC_F_SPIXFM_IOCTRL_SS_DS                      ((uint32_t)(0x1UL << MXC_F_SPIXFM_IOCTRL_SS_DS_POS)) /**< IOCTRL_SS_DS Mask */

#define MXC_F_SPIXFM_IOCTRL_SDIO_DS_POS                2 /**< IOCTRL_SDIO_DS Position */
#define MXC_F_SPIXFM_IOCTRL_SDIO_DS                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_IOCTRL_SDIO_DS_POS)) /**< IOCTRL_SDIO_DS Mask */

#define MXC_F_SPIXFM_IOCTRL_PADCTRL_POS                3 /**< IOCTRL_PADCTRL Position */
#define MXC_F_SPIXFM_IOCTRL_PADCTRL                    ((uint32_t)(0x3UL << MXC_F_SPIXFM_IOCTRL_PADCTRL_POS)) /**< IOCTRL_PADCTRL Mask */
#define MXC_V_SPIXFM_IOCTRL_PADCTRL_TRI_STATE          ((uint32_t)0x0UL) /**< IOCTRL_PADCTRL_TRI_STATE Value */
#define MXC_S_SPIXFM_IOCTRL_PADCTRL_TRI_STATE          (MXC_V_SPIXFM_IOCTRL_PADCTRL_TRI_STATE << MXC_F_SPIXFM_IOCTRL_PADCTRL_POS) /**< IOCTRL_PADCTRL_TRI_STATE Setting */
#define MXC_V_SPIXFM_IOCTRL_PADCTRL_PULL_UP            ((uint32_t)0x1UL) /**< IOCTRL_PADCTRL_PULL_UP Value */
#define MXC_S_SPIXFM_IOCTRL_PADCTRL_PULL_UP            (MXC_V_SPIXFM_IOCTRL_PADCTRL_PULL_UP << MXC_F_SPIXFM_IOCTRL_PADCTRL_POS) /**< IOCTRL_PADCTRL_PULL_UP Setting */
#define MXC_V_SPIXFM_IOCTRL_PADCTRL_PULL_DOWN          ((uint32_t)0x2UL) /**< IOCTRL_PADCTRL_PULL_DOWN Value */
#define MXC_S_SPIXFM_IOCTRL_PADCTRL_PULL_DOWN          (MXC_V_SPIXFM_IOCTRL_PADCTRL_PULL_DOWN << MXC_F_SPIXFM_IOCTRL_PADCTRL_POS) /**< IOCTRL_PADCTRL_PULL_DOWN Setting */

/**@} end of group SPIXFM_IOCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_MEMSECCTRL SPIXFM_MEMSECCTRL
 * @brief    SPIX Memory Security Control Register.
 * @{
 */
#define MXC_F_SPIXFM_MEMSECCTRL_DEC_EN_POS             0 /**< MEMSECCTRL_DEC_EN Position */
#define MXC_F_SPIXFM_MEMSECCTRL_DEC_EN                 ((uint32_t)(0x1UL << MXC_F_SPIXFM_MEMSECCTRL_DEC_EN_POS)) /**< MEMSECCTRL_DEC_EN Mask */

#define MXC_F_SPIXFM_MEMSECCTRL_AUTH_DIS_POS           1 /**< MEMSECCTRL_AUTH_DIS Position */
#define MXC_F_SPIXFM_MEMSECCTRL_AUTH_DIS               ((uint32_t)(0x1UL << MXC_F_SPIXFM_MEMSECCTRL_AUTH_DIS_POS)) /**< MEMSECCTRL_AUTH_DIS Mask */

#define MXC_F_SPIXFM_MEMSECCTRL_CNTOPT_EN_POS          2 /**< MEMSECCTRL_CNTOPT_EN Position */
#define MXC_F_SPIXFM_MEMSECCTRL_CNTOPT_EN              ((uint32_t)(0x1UL << MXC_F_SPIXFM_MEMSECCTRL_CNTOPT_EN_POS)) /**< MEMSECCTRL_CNTOPT_EN Mask */

#define MXC_F_SPIXFM_MEMSECCTRL_INTERL_DIS_POS         3 /**< MEMSECCTRL_INTERL_DIS Position */
#define MXC_F_SPIXFM_MEMSECCTRL_INTERL_DIS             ((uint32_t)(0x1UL << MXC_F_SPIXFM_MEMSECCTRL_INTERL_DIS_POS)) /**< MEMSECCTRL_INTERL_DIS Mask */

#define MXC_F_SPIXFM_MEMSECCTRL_AUTHERR_FL_POS         4 /**< MEMSECCTRL_AUTHERR_FL Position */
#define MXC_F_SPIXFM_MEMSECCTRL_AUTHERR_FL             ((uint32_t)(0x1UL << MXC_F_SPIXFM_MEMSECCTRL_AUTHERR_FL_POS)) /**< MEMSECCTRL_AUTHERR_FL Mask */

/**@} end of group SPIXFM_MEMSECCTRL_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_BUSIDLE SPIXFM_BUSIDLE
 * @brief    Bus Idle
 * @{
 */
#define MXC_F_SPIXFM_BUSIDLE_BUSIDLE_POS               0 /**< BUSIDLE_BUSIDLE Position */
#define MXC_F_SPIXFM_BUSIDLE_BUSIDLE                   ((uint32_t)(0xFFFFUL << MXC_F_SPIXFM_BUSIDLE_BUSIDLE_POS)) /**< BUSIDLE_BUSIDLE Mask */

