analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/spixfm_regs.h
/**@} end of group SPIXFM_BUSIDLE_Register */

/**
 * @ingroup  spixfm_registers
 * @defgroup SPIXFM_BYPASS_MODE SPIXFM_BYPASS_MODE
 * @brief    Bypass Mode Register.
 * @{
 */
#define MXC_F_SPIXFM_BYPASS_MODE_EN_POS                0 /**< BYPASS_MODE_EN Position */
#define MXC_F_SPIXFM_BYPASS_MODE_EN                    ((uint32_t)(0x1UL << MXC_F_SPIXFM_BYPASS_MODE_EN_POS)) /**< BYPASS_MODE_EN Mask */

#define MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS        1 /**< BYPASS_MODE_FCLK_DELAY Position */
#define MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY            ((uint32_t)(0x7UL << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS)) /**< BYPASS_MODE_FCLK_DELAY Mask */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_0_NS       ((uint32_t)0x0UL) /**< BYPASS_MODE_FCLK_DELAY_0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_0_NS       (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_0_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_0P5_NS     ((uint32_t)0x1UL) /**< BYPASS_MODE_FCLK_DELAY_0P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_0P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_0P5_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_0P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P0_NS     ((uint32_t)0x2UL) /**< BYPASS_MODE_FCLK_DELAY_1P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P0_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_1P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P5_NS     ((uint32_t)0x3UL) /**< BYPASS_MODE_FCLK_DELAY_1P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_1P5_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_1P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P0_NS     ((uint32_t)0x4UL) /**< BYPASS_MODE_FCLK_DELAY_2P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P0_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_2P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P5_NS     ((uint32_t)0x5UL) /**< BYPASS_MODE_FCLK_DELAY_2P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_2P5_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_2P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P0_NS     ((uint32_t)0x6UL) /**< BYPASS_MODE_FCLK_DELAY_3P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P0_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_3P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P5_NS     ((uint32_t)0x7UL) /**< BYPASS_MODE_FCLK_DELAY_3P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_FCLK_DELAY_3P5_NS << MXC_F_SPIXFM_BYPASS_MODE_FCLK_DELAY_POS) /**< BYPASS_MODE_FCLK_DELAY_3P5_NS Setting */

#define MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS        4 /**< BYPASS_MODE_SCLK_DELAY Position */
#define MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY            ((uint32_t)(0x7UL << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS)) /**< BYPASS_MODE_SCLK_DELAY Mask */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_0_NS       ((uint32_t)0x0UL) /**< BYPASS_MODE_SCLK_DELAY_0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_0_NS       (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_0_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_0P5_NS     ((uint32_t)0x1UL) /**< BYPASS_MODE_SCLK_DELAY_0P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_0P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_0P5_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_0P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P0_NS     ((uint32_t)0x2UL) /**< BYPASS_MODE_SCLK_DELAY_1P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P0_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_1P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P5_NS     ((uint32_t)0x3UL) /**< BYPASS_MODE_SCLK_DELAY_1P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_1P5_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_1P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P0_NS     ((uint32_t)0x4UL) /**< BYPASS_MODE_SCLK_DELAY_2P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P0_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_2P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P5_NS     ((uint32_t)0x5UL) /**< BYPASS_MODE_SCLK_DELAY_2P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_2P5_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_2P5_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P0_NS     ((uint32_t)0x6UL) /**< BYPASS_MODE_SCLK_DELAY_3P0_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P0_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P0_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_3P0_NS Setting */
#define MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P5_NS     ((uint32_t)0x7UL) /**< BYPASS_MODE_SCLK_DELAY_3P5_NS Value */
#define MXC_S_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P5_NS     (MXC_V_SPIXFM_BYPASS_MODE_SCLK_DELAY_3P5_NS << MXC_F_SPIXFM_BYPASS_MODE_SCLK_DELAY_POS) /**< BYPASS_MODE_SCLK_DELAY_3P5_NS Setting */

/**@} end of group SPIXFM_BYPASS_MODE_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32572_INCLUDE_SPIXFM_REGS_H_
